Incompressible/2D_MultiElementWing/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    frontandback
    {
        type            empty;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity 	 0.005;
        value           0.003; // check
    }
    outlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity 	 0.005;
        value           0.003; // check
    }
    airfoil1
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    airfoil2
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
