Incompressible/2D_MultiElementWing/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear; // NUNCA MEXER... TERMO DIFUSIVO -> CENTRADO DE SEGUNDA ORDEM.
}

laplacianSchemes // Laplaciano da Equação de NS
{
    default         Gauss linear corrected; //Gauss linear orthogonal;
}

interpolationSchemes // interpolação do centroide entre as células
{
    default         linear;
}

snGradSchemes
{
    default         corrected; //orthogonal;
}

wallDist // Calcular a altura do centróide da primeira célula em relação a parede
{
    method meshWave;
}


// ************************************************************************* //
